## How to import data

In [51]:
#for a csv, comma separated values you can use pandas
import pandas as pd
data = pd.read_csv('Popular_Baby_Names.csv')
data.head()

   Year of Birth  Gender Child's First Name  Count  Rank
0           2011  FEMALE          GERALDINE     13    75
1           2011    MALE            VINCENT     71    13
2           2011    MALE             VICTOR     17    49
3           2011    MALE              TYLER     31    35
4           2011    MALE             TRAVIS     11    55

In [52]:
#check the raw format inside a csv
with open('Popular_Baby_Names.csv') as f:
    lines=f.readlines()
lines[:10]

["Year of Birth,Gender,Child's First Name,Count,Rank\n",
 '2011,FEMALE,GERALDINE,13,75\n',
 '2011,MALE,VINCENT,71,13\n',
 '2011,MALE,VICTOR,17,49\n',
 '2011,MALE,TYLER,31,35\n',
 '2011,MALE,TRAVIS,11,55\n',
 '2011,MALE,TONY,16,50\n',
 '2011,MALE,TIMOTHY,16,50\n',
 '2011,MALE,THOMAS,18,48\n',
 '2011,MALE,TERRY,11,55\n']

##Different raw data format, our target is to transit needed data to pd acceptable format

In [ ]:
## If you want to read files, you can use below format
with open("Your file name") as f:   #change file name
    content = f.readlines()         #read file content to content
print(type(content))                #print type of content
print(content[0:10])                #print content, from row 0~10

In [67]:
#If there's space separate
#check the raw format inside a csv
with open('Popular_Baby_Names_space.txt') as f:
    lines=f.readlines()
lines[0:10]

["Year_of_Birth Gender Child's_First_Name Count Rank\n",
 '2011 FEMALE GERALDINE 13 75\n',
 '2011 FEMALE GIA 21 67\n',
 '2011 FEMALE GIANNA 49 42\n',
 '2011 FEMALE GISELLE 38 51\n',
 '2011 FEMALE GRACE 36 53\n',
 '2011 FEMALE GUADALUPE 26 62\n',
 '2011 FEMALE HAILEY 126 8\n',
 '2011 FEMALE HALEY 14 74\n',
 '2011 FEMALE HANNAH 17 71\n']

### How Dataframe can be assigned

In [68]:
#Let's make some data
columns = ['a', 'b', 'c']
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df = pd.DataFrame(data=data, columns=columns)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
#Or you can add more data to df
df['d']=[10,11,12]
df

   a  b  c   d
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12

In [70]:
#Now observe the df again
lines[0:10]

["Year_of_Birth Gender Child's_First_Name Count Rank\n",
 '2011 FEMALE GERALDINE 13 75\n',
 '2011 FEMALE GIA 21 67\n',
 '2011 FEMALE GIANNA 49 42\n',
 '2011 FEMALE GISELLE 38 51\n',
 '2011 FEMALE GRACE 36 53\n',
 '2011 FEMALE GUADALUPE 26 62\n',
 '2011 FEMALE HAILEY 126 8\n',
 '2011 FEMALE HALEY 14 74\n',
 '2011 FEMALE HANNAH 17 71\n']

In [71]:
# the first three column is Year_of_Birth Gender Ethnicity, content is split by space
# we can use a python build in function called split, by default split by space, but you can assign the separator by split(",")
sent = 'This is a sentence sperate by space.'
print(sent)
print(f'We use default split function, the result is {sent.split()}')
sent_comma = 'Another sentence with apple,banana,cat'
print(sent_comma)
print(f'We use comma as seperator, the result is {sent_comma.split(",")}')

This is a sentence sperate by space.
We use default split function, the result is ['This', 'is', 'a', 'sentence', 'sperate', 'by', 'space.']
Another sentence with apple,banana,cat
We use comma as seperator, the result is ['Another sentence with apple', 'banana', 'cat']

In [72]:
# So we can handle space separate word by split, now we only handle first 3 column, so choose from 0~2
columns=lines[0].split()
print(f'This will be the columns names: {columns}')

This will be the columns names: ['Year_of_Birth', 'Gender', "Child's_First_Name", 'Count', 'Rank']

In [73]:
#Now handling the content, in list, if you want to add something into list, you can use append
content = []
for line in lines[1:]:
    content.append(line.split())
    
print(f'Check the first 10 rows of the content: {content[0:10]}')

Check the first 10 rows of the content: [['2011', 'FEMALE', 'GERALDINE', '13', '75'], ['2011', 'FEMALE', 'GIA', '21', '67'], ['2011', 'FEMALE', 'GIANNA', '49', '42'], ['2011', 'FEMALE', 'GISELLE', '38', '51'], ['2011', 'FEMALE', 'GRACE', '36', '53'], ['2011', 'FEMALE', 'GUADALUPE', '26', '62'], ['2011', 'FEMALE', 'HAILEY', '126', '8'], ['2011', 'FEMALE', 'HALEY', '14', '74'], ['2011', 'FEMALE', 'HANNAH', '17', '71'], ['2011', 'FEMALE', 'HAYLEE', '17', '71']]

In [74]:
[x for x in content if len(x)>5]

[]

In [75]:
#Now we can assign both contenct and columns to df
df = pd.DataFrame(data=content, columns=columns)
print(df.head())

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011  FEMALE                GIA    21   67
2          2011  FEMALE             GIANNA    49   42
3          2011  FEMALE            GISELLE    38   51
4          2011  FEMALE              GRACE    36   53

In [7]:
#that's great, now we try to write this to a function for future use
import pandas as pd
def to_df(lines:list)->pd.DataFrame:
    columns=lines[0].split()
    content = []
    for line in lines[1:]:
        content.append(line.split())
    df = pd.DataFrame(data=content, columns=columns)
    return df

In [78]:
# try again, and you'll get same result
data = to_df(lines)
data.head()

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011  FEMALE                GIA    21   67
2          2011  FEMALE             GIANNA    49   42
3          2011  FEMALE            GISELLE    38   51
4          2011  FEMALE              GRACE    36   53

### If format is some wording separate inside?

Below is Data of Year 2011
============================================================
Year_of_Birth Gender Child's_First_Name Count Rank
2011 FEMALE GERALDINE 13 75
2011 MALE VINCENT 71 13

Below is Data of Year 2012
============================================================
Year_of_Birth Gender Child's_First_Name Count Rank
2012 FEMALE EMERSON 11 82
2012 FEMALE VICKY 25 30
"""

In [1]:
#What if there's some wording separate inside?
with open('Popular_Baby_Names_space_spl_year.txt') as f:
    lines=f.readlines()
lines[0:10]

['Below is Data of Year 2011\n',
 '============================================================\n',
 "Year_of_Birth Gender Child's_First_Name Count Rank\n",
 '2011 FEMALE GERALDINE 13 75\n',
 '2011 MALE VINCENT 71 13\n',
 '2011 MALE VICTOR 17 49\n',
 '2011 MALE TYLER 31 35\n',
 '2011 MALE TRAVIS 11 55\n',
 '2011 MALE TONY 16 50\n',
 '2011 MALE TIMOTHY 16 50\n']

In [2]:
#In this case, observing data, you'll see there's a special character '=' inside
#So we want to get location of each '=' in list
location = []
for idx in range(len(lines)):
    if '=' in lines[idx]:
        location.append(idx)
print(f'Location of each "=" is: {location})')

Location of each "=" is: [1, 11757, 23632, 35525, 47619, 49668, 51735, 53712, 55680])

In [3]:
## so we know if we want to get header, will be each location +1, and we want to extract the data we want
start = location[0]+1
end = location[1]-2
print(f'first loc is {start} and end will be {end}')
print(f'check it: Start {lines[start]}, end: {lines[end-1]}')

first loc is 2 and end will be 11755
check it: Start Year_of_Birth Gender Child's_First_Name Count Rank
, end: 2011 MALE SHALOM 11 96

In [8]:
#So we can put lines[start:end] to previous function
to_df(lines[start:end]).head()

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011    MALE            VINCENT    71   13
2          2011    MALE             VICTOR    17   49
3          2011    MALE              TYLER    31   35
4          2011    MALE             TRAVIS    11   55

In [9]:
#Because the data is in a split format, we'll need a append function to merge together
columns1 = ['a', 'b', 'c']
data1 = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df1 = pd.DataFrame(data=data1, columns=columns1)

columns2 = ['a', 'b', 'c']
data2 = [[10, 11, 12], [13, 14, 15], [16, 17, 18]]
df2 = pd.DataFrame(data=data2, columns=columns2)

print(f'df1:\n{df1}')
print(f'df2:\n{df2}')

#Now we can append together
df = pd.concat([df1, df2], ignore_index=True,)
print(f'After merge, df:\n{df}')

df1:
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9
df2:
    a   b   c
0  10  11  12
1  13  14  15
2  16  17  18
After merge, df:
    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

In [10]:
#Observing below, you'll see df is printed by year
for idx in range(len(location)):
    if idx>=len(location)-1:
        start = location[idx]+1
        end = None
    else:
        start = location[idx]+1
        end = location[idx+1]-2
    print(to_df(lines[start:end]).head())

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011    MALE            VINCENT    71   13
2          2011    MALE             VICTOR    17   49
3          2011    MALE              TYLER    31   35
4          2011    MALE             TRAVIS    11   55
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2012  FEMALE            EMERSON    11   82
1          2012  FEMALE              VICKY    25   30
2          2012  FEMALE              ALANI    13   44
3          2012  FEMALE              ALANA    25   32
4          2012  FEMALE           AISSATOU    13   44
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2013  FEMALE             Skylah    10   78
1          2013  FEMALE           Michelle    31   21
2          2013  FEMALE             Sophia   291    2
3          2013  FEMALE              Sofia   187    4
4          2013    MALE              Gavin    27   78
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2014    MALE             Connor    21   47
1          2014    MALE            Matthew   131   22
2          2014  FEMALE               Lucy    58   41
3          2014  FEMALE              Nylah    34   17
4          2014    MALE            Grayson    30   82
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2015  FEMALE            Arianna    33   60
1          2015  FEMALE               Ella    26   65
2          2015    MALE           Nicholas    32   41
3          2015    MALE             Aaryan    10   55
4          2015  FEMALE              Anaya    44   13
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2016    MALE             August    26   83
1          2016    MALE             August    12   89
2          2016  FEMALE             Analia    15   69
3          2016    MALE               Joel    55   51
4          2016  FEMALE               Elsa    13   38
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2017  FEMALE              Faith    35   13
1          2017  FEMALE                Zoe    35   13
2          2017  FEMALE               Zuri    34   14
3          2017  FEMALE               Aria    31   17
4          2017  FEMALE             Fatima    32   16
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2018    MALE              David   129   15
1          2018    MALE             Daniel   133   14
2          2018    MALE              Mason   135   13
3          2018  FEMALE             Everly    10   85
4          2018    MALE          Alexander   151   11
  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2019  FEMALE              Maria    40   55
1          2019  FEMALE               Luna    44   51
2          2019  FEMALE               Toby    43   52
3          2019  FEMALE             Vivian    43   52
4          2019  FEMALE              Chava    42   53

In [13]:
#Now we want to save this to a df for storage, and you had a complete dataframe
df=pd.DataFrame()
for idx in range(len(location)):
    if idx>=len(location)-1:
        start = location[idx]+1
        end = None
    else:
        start = location[idx]+1
        end = location[idx+1]-2
    tmp = to_df(lines[start:end])
    df = pd.concat([df, tmp], ignore_index=True,)
df.head()

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011    MALE            VINCENT    71   13
2          2011    MALE             VICTOR    17   49
3          2011    MALE              TYLER    31   35
4          2011    MALE             TRAVIS    11   55

### If data we had is a aligned format
"""
Year_of_Birth   Gender      Child's_First_Name  Count   Rank
2011            FEMALE      GERALDINE           13      75
2011            MALE        VINCENT             71      13
2011            MALE        VICTOR              17      49
2011            MALE        TYLER               31      35
"""

In [16]:
#What if there's some wording separate inside?
with open('Popular_Baby_Names_space_tab_lign.txt') as f:
    lines=f.readlines()
lines[0:10]

["Year_of_Birth   Gender      Child's_First_Name  Count   Rank\n",
 '2011            FEMALE      GERALDINE           13      75\n',
 '2011            MALE        VINCENT             71      13\n',
 '2011            MALE        VICTOR              17      49\n',
 '2011            MALE        TYLER               31      35']

In [19]:
#Previous function can also apply
df = to_df(lines)
df.head()

  Year_of_Birth  Gender Child's_First_Name Count Rank
0          2011  FEMALE          GERALDINE    13   75
1          2011    MALE            VINCENT    71   13
2          2011    MALE             VICTOR    17   49
3          2011    MALE              TYLER    31   35

### Save file

In [21]:
#Once you had a dataframe, you can perform many caculation ot join, we'll introduce in afterward, now you can save df to a csv
df.to_csv('df.csv', index=False)